apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_qspi.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_qspi.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_QSPI_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_QSPI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* QSPI Register Offsets ****************************************************/

#define S32K3XX_QSPI_MCR_OFFSET           (0x0000) /* Module Configuration Register (MCR) */
#define S32K3XX_QSPI_IPCR_OFFSET          (0x0008) /* IP Configuration Register (IPCR) */
#define S32K3XX_QSPI_FLSHCR_OFFSET        (0x000c) /* Flash Memory Configuration Register (FLSHCR) */
#define S32K3XX_QSPI_BUF0CR_OFFSET        (0x0010) /* Buffer 0 Configuration Register (BUF0CR) */
#define S32K3XX_QSPI_BUF1CR_OFFSET        (0x0014) /* Buffer 1 Configuration Register (BUF1CR) */
#define S32K3XX_QSPI_BUF2CR_OFFSET        (0x0018) /* Buffer 2 Configuration Register (BUF2CR) */
#define S32K3XX_QSPI_BUF3CR_OFFSET        (0x001c) /* Buffer 3 Configuration Register (BUF3CR) */
#define S32K3XX_QSPI_BFGENCR_OFFSET       (0x0020) /* Buffer Generic Configuration Register (BFGENCR) */
#define S32K3XX_QSPI_SOCCR_OFFSET         (0x0024) /* SOC Configuration Register (SOCCR) */
#define S32K3XX_QSPI_BUF0IND_OFFSET       (0x0030) /* Buffer 0 Top Index Register (BUF0IND) */
#define S32K3XX_QSPI_BUF1IND_OFFSET       (0x0034) /* Buffer 1 Top Index Register (BUF1IND) */
#define S32K3XX_QSPI_BUF2IND_OFFSET       (0x0038) /* Buffer 2 Top Index Register (BUF2IND) */
#define S32K3XX_QSPI_DLLCRA_OFFSET        (0x0060) /* DLL Flash Memory A Configuration Register (DLLCRA) */
#define S32K3XX_QSPI_SFAR_OFFSET          (0x0100) /* Serial Flash Memory Address Register (SFAR) */
#define S32K3XX_QSPI_SMPR_OFFSET          (0x0108) /* Sampling Register (SMPR) */
#define S32K3XX_QSPI_RBSR_OFFSET          (0x010c) /* RX Buffer Status Register (RBSR) */
#define S32K3XX_QSPI_RBCT_OFFSET          (0x0110) /* RX Buffer Control Register (RBCT) */
#define S32K3XX_QSPI_DLSR_FA_OFFSET       (0x0134) /* Data Learning Status Flash Memory A Register (DLSR_FA) */
#define S32K3XX_QSPI_TBSR_OFFSET          (0x0150) /* TX Buffer Status Register (TBSR) */
#define S32K3XX_QSPI_TBDR_OFFSET          (0x0154) /* TX Buffer Data Register (TBDR) */
#define S32K3XX_QSPI_TBCT_OFFSET          (0x0158) /* TX Buffer Control Register (TBCT) */
#define S32K3XX_QSPI_SR_OFFSET            (0x015c) /* Status Register (SR) */
#define S32K3XX_QSPI_FR_OFFSET            (0x0160) /* Flag Register (FR) */
#define S32K3XX_QSPI_RSER_OFFSET          (0x0164) /* Interrupt and DMA Request Select and Enable Register (RSER) */
#define S32K3XX_QSPI_SPTRCLR_OFFSET       (0x016c) /* Sequence Pointer Clear Register (SPTRCLR) */
#define S32K3XX_QSPI_SFA1AD_OFFSET        (0x0180) /* Serial Flash Memory A1 Top Address Register (SFA1AD) */
#define S32K3XX_QSPI_SFA2AD_OFFSET        (0x0184) /* Serial Flash Memory A2 Top Address Register (SFA2AD) */
#define S32K3XX_QSPI_SFB1AD_OFFSET        (0x0188) /* Serial Flash Memory B1 Top Address Register (SFB1AD) */
#define S32K3XX_QSPI_SFB2AD_OFFSET        (0x018c) /* Serial Flash Memory B2 Top Address Register (SFB2AD) */

#define S32K3XX_QSPI_RBDR_OFFSET(n)       (0x0200 + ((n) << 2)) /* RX Buffer Data Register (RBDRn, n=0,...,63) */

#define S32K3XX_QSPI_LUTKEY_OFFSET        (0x0300) /* LUT Key Register (LUTKEY) */
#define S32K3XX_QSPI_LCKCR_OFFSET         (0x0304) /* LUT Lock Configuration Register (LKCR) */
#define S32K3XX_QSPI_LUT0_OFFSET          (0x0310) /* LUT Register 0 (LUT0) */
#define S32K3XX_QSPI_LUT1_OFFSET          (0x0314) /* LUT Register 1 (LUT1) */
#define S32K3XX_QSPI_LUT2_OFFSET          (0x0318) /* LUT Register 2 (LUT2) */
#define S32K3XX_QSPI_LUT3_OFFSET          (0x031c) /* LUT Register 3 (LUT3) */
#define S32K3XX_QSPI_LUT4_OFFSET          (0x0320) /* LUT Register 4 (LUT4) */
#define S32K3XX_QSPI_LUT5_OFFSET          (0x0324) /* LUT Register 5 (LUT5) */
#define S32K3XX_QSPI_LUT6_OFFSET          (0x0328) /* LUT Register 6 (LUT6) */
#define S32K3XX_QSPI_LUT7_OFFSET          (0x032c) /* LUT Register 7 (LUT7) */
#define S32K3XX_QSPI_LUT8_OFFSET          (0x0330) /* LUT Register 8 (LUT8) */
#define S32K3XX_QSPI_LUT9_OFFSET          (0x0334) /* LUT Register 9 (LUT9) */
#define S32K3XX_QSPI_LUT10_OFFSET         (0x0338) /* LUT Register 10 (LUT10) */
#define S32K3XX_QSPI_LUT11_OFFSET         (0x033c) /* LUT Register 11 (LUT11) */
#define S32K3XX_QSPI_LUT12_OFFSET         (0x0340) /* LUT Register 12 (LUT12) */
#define S32K3XX_QSPI_LUT13_OFFSET         (0x0344) /* LUT Register 13 (LUT13) */
#define S32K3XX_QSPI_LUT14_OFFSET         (0x0348) /* LUT Register 14 (LUT14) */
#define S32K3XX_QSPI_LUT15_OFFSET         (0x034c) /* LUT Register 15 (LUT15) */
#define S32K3XX_QSPI_LUT16_OFFSET         (0x0350) /* LUT Register 16 (LUT16) */
#define S32K3XX_QSPI_LUT17_OFFSET         (0x0354) /* LUT Register 17 (LUT17) */
#define S32K3XX_QSPI_LUT18_OFFSET         (0x0358) /* LUT Register 18 (LUT18) */
#define S32K3XX_QSPI_LUT19_OFFSET         (0x035c) /* LUT Register 19 (LUT19) */

/* QSPI Register Addresses **************************************************/

