apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_qspi.h
#define S32K3XX_QSPI_MCR                  (S32K3XX_QSPI_BASE + S32K3XX_QSPI_MCR_OFFSET)
#define S32K3XX_QSPI_IPCR                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_IPCR_OFFSET)
#define S32K3XX_QSPI_FLSHCR               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_FLSHCR_OFFSET)
#define S32K3XX_QSPI_BUF0CR               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BUF0CR_OFFSET)
#define S32K3XX_QSPI_BUF1CR               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BUF1CR_OFFSET)
#define S32K3XX_QSPI_BUF2CR               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BUF2CR_OFFSET)
#define S32K3XX_QSPI_BUF3CR               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BUF3CR_OFFSET)
#define S32K3XX_QSPI_BFGENCR              (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BFGENCR_OFFSET)
#define S32K3XX_QSPI_SOCCR                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SOCCR_OFFSET)
#define S32K3XX_QSPI_BUF0IND              (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BUF0IND_OFFSET)
#define S32K3XX_QSPI_BUF1IND              (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BUF1IND_OFFSET)
#define S32K3XX_QSPI_BUF2IND              (S32K3XX_QSPI_BASE + S32K3XX_QSPI_BUF2IND_OFFSET)
#define S32K3XX_QSPI_DLLCRA               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_DLLCRA_OFFSET)
#define S32K3XX_QSPI_SFAR                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SFAR_OFFSET)
#define S32K3XX_QSPI_SMPR                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SMPR_OFFSET)
#define S32K3XX_QSPI_RBSR                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_RBSR_OFFSET)
#define S32K3XX_QSPI_RBCT                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_RBCT_OFFSET)
#define S32K3XX_QSPI_DLSR_FA              (S32K3XX_QSPI_BASE + S32K3XX_QSPI_DLSR_FA_OFFSET)
#define S32K3XX_QSPI_TBSR                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_TBSR_OFFSET)
#define S32K3XX_QSPI_TBDR                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_TBDR_OFFSET)
#define S32K3XX_QSPI_TBCT                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_TBCT_OFFSET)
#define S32K3XX_QSPI_SR                   (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SR_OFFSET)
#define S32K3XX_QSPI_FR                   (S32K3XX_QSPI_BASE + S32K3XX_QSPI_FR_OFFSET)
#define S32K3XX_QSPI_RSER                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_RSER_OFFSET)
#define S32K3XX_QSPI_SPTRCLR              (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SPTRCLR_OFFSET)
#define S32K3XX_QSPI_SFA1AD               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SFA1AD_OFFSET)
#define S32K3XX_QSPI_SFA2AD               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SFA2AD_OFFSET)
#define S32K3XX_QSPI_SFB1AD               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SFB1AD_OFFSET)
#define S32K3XX_QSPI_SFB2AD               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_SFB2AD_OFFSET)
#define S32K3XX_QSPI_RBDR(n)              (S32K3XX_QSPI_BASE + S32K3XX_QSPI_RBDR_OFFSET(n))
#define S32K3XX_QSPI_LUTKEY               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUTKEY_OFFSET)
#define S32K3XX_QSPI_LCKCR                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LCKCR_OFFSET)
#define S32K3XX_QSPI_LUT0                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT0_OFFSET)
#define S32K3XX_QSPI_LUT1                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT1_OFFSET)
#define S32K3XX_QSPI_LUT2                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT2_OFFSET)
#define S32K3XX_QSPI_LUT3                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT3_OFFSET)
#define S32K3XX_QSPI_LUT4                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT4_OFFSET)
#define S32K3XX_QSPI_LUT5                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT5_OFFSET)
#define S32K3XX_QSPI_LUT6                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT6_OFFSET)
#define S32K3XX_QSPI_LUT7                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT7_OFFSET)
#define S32K3XX_QSPI_LUT8                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT8_OFFSET)
#define S32K3XX_QSPI_LUT9                 (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT9_OFFSET)
#define S32K3XX_QSPI_LUT10                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT10_OFFSET)
#define S32K3XX_QSPI_LUT11                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT11_OFFSET)
#define S32K3XX_QSPI_LUT12                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT12_OFFSET)
#define S32K3XX_QSPI_LUT13                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT13_OFFSET)
#define S32K3XX_QSPI_LUT14                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT14_OFFSET)
#define S32K3XX_QSPI_LUT15                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT15_OFFSET)
#define S32K3XX_QSPI_LUT16                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT16_OFFSET)
#define S32K3XX_QSPI_LUT17                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT17_OFFSET)
#define S32K3XX_QSPI_LUT18                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT18_OFFSET)
#define S32K3XX_QSPI_LUT19                (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT19_OFFSET)

#define S32K3XX_QSPI_LUT(n)               (S32K3XX_QSPI_BASE + S32K3XX_QSPI_LUT0_OFFSET + (n*4))
#define S32K3XX_QSPI_LUT_COUNT            20

/* QSPI Register Bitfield Definitions ***************************************/

/* Module Configuration Register (MCR) */

#define QSPI_MCR_SWRSTSD                  (1 << 0)  /* Bit 0: Software reset for serial flash memory domain (SWRSTSD) */
#define QSPI_MCR_SWRSTHD                  (1 << 1)  /* Bit 1: Software reset for AHB domain (SWRSTHD) */
                                                    /* Bits 2-9: Reserved */
#define QSPI_MCR_CLR_RXF                  (1 << 10) /* Bit 10: Clear RX FIFO (CLR_RXF) */
#define QSPI_MCR_CLR_TXF                  (1 << 11) /* Bit 11: Clear TX FIFO/buffer (CLR_TXF) */
                                                    /* Bits 12-13: Reserved */
#define QSPI_MCR_MDIS                     (1 << 14) /* Bit 14: Module disable (MDIS) */
                                                    /* Bits 15-23: Reserved */
#define QSPI_MCR_DQS_FA_SEL_SHIFT         (24)      /* Bits 24-25: DQS clock for sampling read data at flash memory A (DQS_FA_SEL) */
#define QSPI_MCR_DQS_FA_SEL_MASK          (0x03 << QSPI_MCR_DQS_FA_SEL_SHIFT)
#define QSPI_MCR_DQS_FA_SEL_INTERNAL_DQS  ((0x00 << QSPI_MCR_DQS_FA_SEL_SHIFT) & QSPI_MCR_DQS_FA_SEL_MASK)
#define QSPI_MCR_DQS_FA_SEL_LOOPBACK      ((0x01 << QSPI_MCR_DQS_FA_SEL_SHIFT) & QSPI_MCR_DQS_FA_SEL_MASK)
#define QSPI_MCR_DQS_FA_SEL_LOOPBACK_DQS  ((0x02 << QSPI_MCR_DQS_FA_SEL_SHIFT) & QSPI_MCR_DQS_FA_SEL_MASK)
                                                    /* Bits 26-31: Reserved */

