apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_qspi.h
/* IP Configuration Register (IPCR) */

#define QSPICR_IDATSZ_SHIFT            (0)       /* Bits 0-15: IP data transfer size (IDATSZ) */
#define QSPICR_IDATSZ_MASK             (0xffff << QSPICR_IDATSZ_SHIFT)
#define QSPICR_IDATSZ(n)               (((n) << QSPICR_IDATSZ_SHIFT) & QSPICR_IDATSZ_MASK)
                                                    /* Bits 16-23: Reserved */
#define QSPICR_SEQID_SHIFT             (24)         /* Bits 24-27: Points to a sequence in the LUT (SEQID) */
#define QSPICR_SEQID_MASK              (0x0f << QSPICR_SEQID_SHIFT)
#define QSPICR_SEQID(n)                (((n) << QSPICR_SEQID_SHIFT) & QSPICR_SEQID_MASK)
                                                    /* Bits 28-31: Reserved */

/* Flash Memory Configuration Register (FLSHCR) */

#define QSPI_FLSHCR_TCSS_SHIFT            (0)       /* Bits 0-3: Serial flash memory CS setup time (TCSS) */
#define QSPI_FLSHCR_TCSS_MASK             (0x0f << QSPI_FLSHCR_TCSS_SHIFT)
#define QSPI_FLSHCR_TCSS(n)               (n & QSPI_FLSHCR_TCSS_MASK)
#define QSPI_FLSHCR_TCSH_SHIFT            (8)       /* Bits 8-11: Serial flash memory CS hold time (TCSH) */
#define QSPI_FLSHCR_TCSH_MASK             (0x0f << QSPI_FLSHCR_TCSH_SHIFT)
#define QSPI_FLSHCR_TCSH(n)               (((n) << QSPI_FLSHCR_TCSH_SHIFT) & QSPI_FLSHCR_TCSH_MASK)
                                                    /* Bits 12-31: Reserved */

/* Buffer n Configuration Register (BUFnCR) */

#define QSPI_BUFCR_MSTRID_SHIFT           (0)       /* Bits 0-3: Master ID (MSTRID) */
#define QSPI_BUFCR_MSTRID_MASK            (0x0f << QSPI_BUFCR_MSTRID_SHIFT)
#define QSPI_BUFCR_MSTRID(n)              (((n) << QSPI_BUFCR_MSTRID_SHIFT) & QSPI_BUFCR_MSTRID_MASK)
                                                    /* Bits 4-7: Reserved */
#define QSPI_BUFCR_ADATSZ_SHIFT           (8)       /* Bits 8-13: AHB data transfer size (ADATSZ) */
#define QSPI_BUFCR_ADATSZ_MASK            (0x3f << QSPI_BUFCR_ADATSZ_SHIFT)
#define QSPI_BUFCR_ADATSZ(n)              (((n) << QSPI_BUFCR_ADATSZ_SHIFT) & QSPI_BUFCR_ADATSZ_MASK)
                                                    /* Bits 14-31: Reserved */
#define QSPI_BUF3CR_ALLMST                (1 << 31) /* Bit 31: All master enable (ALLMST) */

/* Buffer Generic Configuration Register (BFGENCR) */

                                                    /* Bits 0-11: Reserved */
#define QSPI_BFGENCR_SEQID_SHIFT          (12)      /* Bits 12-15: Points to a sequence in the LUT (SEQID) */
#define QSPI_BFGENCR_SEQID_MASK           (0x0f << QSPI_BFGENCR_SEQID_SHIFT)
                                                    /* Bits 16-31: Reserved */

/* SOC Configuration Register (SOCCR) */

#define QSPI_SOCCR_SOCCFG_SHIFT           (0)       /* Bits 0-31: SOC configuration (SOCCFG) */
#define QSPI_SOCCR_SOCCFG_MASK            (0xffffffff << QSPI_SOCCR_SOCCFG_SHIFT)
#define QSPI_SOCCR_OBE_PULL_TMG_RLX       (1 << 0) /* Bit 0: obe_pull_timing_relax_b*/
#define QSPI_SOCCR_IBE                    (1 << 1) /* Bit 1: IBE */
#define QSPI_SOCCR_OBE                    (1 << 2) /* Bit 2: OBE */
#define QSPI_SOCCR_DSE                    (1 << 3) /* Bit 3: DSE */
#define QSPI_SOCCR_PUE                    (1 << 4) /* Bit 4: PUE */
#define QSPI_SOCCR_PUS                    (1 << 5) /* Bit 5: PUS */
#define QSPI_SOCCR_SRE                    (1 << 6) /* Bit 6: SRE */

/* Buffer n Top Index Register (BUFnIND) */

                                                    /* Bits 0-2: Reserved */
#define QSPI_BUFIND_TPINDX_SHIFT          (3)       /* Bits 3-8: Top index of buffer n (TPINDXn) */
#define QSPI_BUFIND_TPINDX_MASK           (0x3f << QSPI_BUFIND_TPINDX_SHIFT)
                                                    /* Bits 9-31: Reserved */

/* DLL Flash Memory A Configuration Register (DLLCRA) */

#define QSPI_DLLCRA_SLV_UPD               (1 << 0)  /* Bit 0: Slave update (SLV_UPD) */
#define QSPI_DLLCRA_SLV_DLL_BYPASS        (1 << 1)  /* Bit 1: Slave DLL bypass (SLV_DLL_BYPASS) */
#define QSPI_DLLCRA_SLV_EN                (1 << 2)  /* Bit 2: Slave enable (SLV_EN) */
                                                    /* Bits 3-7: Reserved */

#define QSPI_DLLCRA_SLV_DLY_COARSE_SHIFT  (8)       /* Bits 8-11: Delay elements in each delay tap (SLV_DLY_COARSE) */
#define QSPI_DLLCRA_SLV_DLY_COARSE_MASK   (0x0f << QSPI_DLLCRA_SLV_DLY_COARSE_SHIFT)
#define QSPI_DLLCRA_SLV_DLY_COARSE(n)     (((n) << QSPI_DLLCRA_SLV_DLY_COARSE_SHIFT) & QSPI_DLLCRA_SLV_DLY_COARSE_MASK)
#define QSPI_DLLCRA_SLV_DLY_OFFSET_SHIFT  (12)      /* Bits 12-14: T/16 offset delay elements in incoming DQS (SLV_DLY_OFFSET) */
#define QSPI_DLLCRA_SLV_DLY_OFFSET_MASK   (0x07 << QSPI_DLLCRA_SLV_DLY_OFFSET_SHIFT)
#define QSPI_DLLCRA_SLV_DLY(n)     (((n) << QSPI_DLLCRA_SLV_DLY_OFFSET_SHIFT) & QSPI_DLLCRA_SLV_DLY_OFFSET_MASK)
                                                    /* Bit 15: Reserved */
#define QSPI_DLLCRA_SLV_FINE_OFFSET_SHIFT (16)      /* Bits 16-19: Fine offset delay elements in incoming DQS (SLV_FINE_OFFSET) */
#define QSPI_DLLCRA_SLV_FINE_OFFSET_MASK  (0x0f << QSPI_DLLCRA_SLV_FINE_OFFSET_SHIFT)
                                                    /* Bits 20-29: Reserved */
#define QSPI_DLLCRA_FREQEN                (1 << 30) /* Bit 30: Frequency enable (FREQEN) */
                                                    /* Bit 31: Reserved */

/* Serial Flash Memory Address Register (SFAR) */

#define QSPI_SFAR_SFADR_SHIFT             (0)       /* Bits 0-31: Serial flash memory address (SFADR) */
#define QSPI_SFAR_SFADR_MASK              (0xffffffff << QSPI_SFAR_SFADR_SHIFT)

/* Sampling Register (SMPR) */

                                                    /* Bits 0-4: Reserved */
#define QSPI_SMPR_FSPHS                   (1 << 5)  /* Bit 5: Full speed phase selection for SDR instructions (FSPHS) */
#define QSPI_SMPR_FSDLY                   (1 << 6)  /* Bit 6: Full speed delay section for SDR instructions (FSDLY) */
                                                    /* Bits 7-23: Reserved */
#define QSPI_SMPR_DLLFSMPFA_SHIFT         (24)      /* Bits 24-26: Selects the nth tap provided by slave delay chain for flash memory A (DLLFSMPFA) */
#define QSPI_SMPR_DLLFSMPFA_MASK          (0x07 << QSPI_SMPR_DLLFSMPFA_SHIFT)
#define QSPI_SMPR_DLLFSMPFA(n)            (((n) << QSPI_SMPR_DLLFSMPFA_SHIFT) & QSPI_SMPR_DLLFSMPFA_MASK)
                                                    /* Bits 27-31: Reserved */

/* RX Buffer Status Register (RBSR) */

#define QSPI_RBSR_RDBFL_SHIFT             (0)       /* Bits 0-7: RX buffer fill level (RDBFL) */
#define QSPI_RBSR_RDBFL_MASK              (0xff << QSPI_RBSR_RDBFL_SHIFT)
                                                    /* Bits 8-15: Reserved */
#define QSPI_RBSR_RDCTR_SHIFT             (16)      /* Bits 16-31: Read counter (RDCTR) */
#define QSPI_RBSR_RDCTR_MASK              (0xffff << QSPI_RBSR_RDCTR_SHIFT)

/* RX Buffer Control Register (RBCT) */

