apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_qspi.h
#define QSPI_RBCT_WMRK_SHIFT              (0)       /* Bits 0-6: RX buffer watermark (WMRK) */
#define QSPI_RBCT_WMRK_MASK               (0x7f << QSPI_RBCT_WMRK_SHIFT)
#define QSPI_RBCT_WMRK(n)                 (((n) << QSPI_RBCT_WMRK_SHIFT) & QSPI_RBCT_WMRK_MASK)
                                                    /* Bit 7: Reserved */
#define QSPI_RBCT_RXBRD                   (1 << 8)  /* Bit 8: RX buffer readout (RXBRD) */
#  define QSPI_RBCT_RXBRD_AHB             (0 << 8)  /*        RX buffer content is read using the AHB bus registers */
#  define QSPI_RBCT_RXBRD_IP              (1 << 8)  /*        RX buffer content is read using the IP bus registers */
                                                    /* Bits 9-31: Reserved */

/* Data Learning Status Flash Memory A Register (DLSR_FA) */

#define QSPI_DLSR_FA_NEG_EDGE_SHIFT       (0)       /* Bits 0-7: DLP negative edge match signature for flash memory A (NEG_EDGE) */
#define QSPI_DLSR_FA_NEG_EDGE_MASK        (0xff << QSPI_DLSR_FA_NEG_EDGE_SHIFT)
#define QSPI_DLSR_FA_POS_EDGE_SHIFT       (8)       /* Bits 8-15: DLP positive edge match signature for flash memory A (POS_EDGE) */
#define QSPI_DLSR_FA_POS_EDGE_MASK        (0xff << QSPI_DLSR_FA_POS_EDGE_SHIFT)
                                                    /* Bits 16-30: Reserved */
#define QSPI_DLSR_FA_DLPFFA               (1 << 31) /* Bit 31: Data learning pattern fail (DLPFFA) */

/* TX Buffer Status Register (TBSR) */

#define QSPI_TBSR_TRBLF_SHIFT             (0)       /* Bits 0-5: TX buffer fill level (TRBFL) */
#define QSPI_TBSR_TRBLF_MASK              (0x3f << QSPI_TBSR_TRBLF_SHIFT)
                                                    /* Bits 6-15: Reserved */
#define QSPI_TBSR_TRCTR_SHIFT             (16)      /* Bits 16-31: Transmit counter (TRCTR) */
#define QSPI_TBSR_TRCTR_MASK              (0xffff << QSPI_TBSR_TRCTR_SHIFT)

/* TX Buffer Data Register (TBDR) */

#define QSPI_TBDR_TXDATA_SHIFT            (0)       /* Bits 0-31: TX data (TXDATA) */
#define QSPI_TBDR_TXDATA_MASK             (0xffffffff << QSPI_TBDR_TXDATA_SHIFT)

/* TX Buffer Control Register (TBCT) */

#define QSPI_TBCT_WMRK_SHIFT              (0)       /* Bits 0-4: Watermark for TX buffer (WMRK) */
#define QSPI_TBCT_WMRK_MASK               (0x1f << QSPI_TBCT_WMRK_SHIFT)
#define QSPI_TBCT_WMRK(n)                 (((n) << QSPI_TBCT_WMRK_SHIFT) & QSPI_TBCT_WMRK_MASK)
                                                    /* Bits 5-31: Reserved */

/* Status Register (SR) */

#define QSPI_SR_BUSY                      (1 << 0)  /* Bit 0: Module busy (BUSY) */
#define QSPI_SR_IP_ACC                    (1 << 1)  /* Bit 1: IP access (IP_ACC) */
#define QSPI_SR_AHB_ACC                   (1 << 2)  /* Bit 2: AHB read access (AHB_ACC) */
                                                    /* Bits 3-5: Reserved */
#define QSPI_SR_AHBTRN                    (1 << 6)  /* Bit 6: AHB access transaction pending (AHBTRN) */
#define QSPI_SR_AHB0NE                    (1 << 7)  /* Bit 7: AHB 0 buffer not empty (AHB0NE) */
#define QSPI_SR_AHB1NE                    (1 << 8)  /* Bit 8: AHB 1 buffer not empty (AHB1NE) */
#define QSPI_SR_AHB2NE                    (1 << 9)  /* Bit 9: AHB 2 buffer not empty (AHB2NE) */
#define QSPI_SR_AHB3NE                    (1 << 10) /* Bit 10: AHB 3 buffer not empty (AHB3NE) */
#define QSPI_SR_AHB0FUL                   (1 << 11) /* Bit 11: AHB 0 buffer full (AHB0FUL) */
#define QSPI_SR_AHB1FUL                   (1 << 12) /* Bit 12: AHB 1 buffer full (AHB1FUL) */
#define QSPI_SR_AHB2FUL                   (1 << 13) /* Bit 13: AHB 2 buffer full (AHB2FUL) */
#define QSPI_SR_AHB3FUL                   (1 << 14) /* Bit 14: AHB 3 buffer full (AHB3FUL) */
                                                    /* Bit 15: Reserved */
#define QSPI_SR_RXWE                      (1 << 16) /* Bit 16: RX buffer watermark exceeded (RXWE) */
                                                    /* Bits 17-18: Reserved */
#define QSPI_SR_RXFULL                    (1 << 19) /* Bit 19: RX buffer full (RXFULL) */
                                                    /* Bits 20-22: Reserved */
#define QSPI_SR_RXDMA                     (1 << 23) /* Bit 23: RX buffer DMA (RXDMA) */
#define QSPI_SR_TXNE                      (1 << 24) /* Bit 24: TX buffer not empty (TXNE) */
#define QSPI_SR_TXWA                      (1 << 25) /* Bit 25: TX buffer watermark available (TXWA) */
#define QSPI_SR_TXDMA                     (1 << 26) /* Bit 26: TX buffer DMA (TXDMA) */
#define QSPI_SR_TXFUL                     (1 << 27) /* Bit 27: TX buffer full (TXFULL) */
                                                    /* Bits 28-31: Reserved */

/* Flag Register (FR) */

#define QSPI_FR_TFF                       (1 << 0)  /* Bit 0: IP command transaction finished flag (TFF) */
                                                    /* Bits 1-5: Reserved */
#define QSPI_FR_IPIEF                     (1 << 6)  /* Bit 6: IP command trigger could not be executed error flag (IPIEF) */
#define QSPI_FR_IPAEF                     (1 << 7)  /* Bit 7: IP command trigger during AHB access error flag (IPAEF) */
                                                    /* Bits 8-11: Reserved */
#define QSPI_FR_ABOF                      (1 << 12) /* Bit 12: AHB buffer overflow flag (ABOF) */
#define QSPI_FR_AIBSEF                    (1 << 13) /* Bit 13: AHB illegal burst size error flag (AIBSEF) */
#define QSPI_FR_AITEF                     (1 << 14) /* Bit 14: AHB illegal transaction error flag (AITEF) */
                                                    /* Bit 15: Reserved */
#define QSPI_FR_RBDF                      (1 << 16) /* Bit 16: RX buffer drain flag (RBDF) */
#define QSPI_FR_RBOF                      (1 << 17) /* Bit 17: RX buffer overflow flag (RBOF) */
                                                    /* Bits 18-22: Reserved */
#define QSPI_FR_ILLINE                    (1 << 23) /* Bit 23: Illegal instruction error flag (ILLINE) */
                                                    /* Bits 24-25: Reserved */
#define QSPI_FR_TBUF                      (1 << 26) /* Bit 26: TX buffer underrun flag (TBUF) */
#define QSPI_FR_TBFF                      (1 << 27) /* Bit 27: TX buffer fill flag (TBFF) */
                                                    /* Bits 28-31: Reserved */

/* Interrupt and DMA Request Select and Enable Register (RSER) */

#define QSPI_RSER_TFIE                    (1 << 0)  /* Bit 0: Transaction finished interrupt enable flag (TFIE) */
                                                    /* Bits 1-5: Reserved */
#define QSPI_RSER_IPIEIE                  (1 << 6)  /* Bit 6: IP command trigger during IP access error interrupt enable flag (IPIEIE) */
#define QSPI_RSER_IPAEIE                  (1 << 7)  /* Bit 7: IP command trigger during AHB read access error interrupt enable flag (IPAEIE) */
                                                    /* Bits 8-11: Reserved */
#define QSPI_RSER_ABOIE                   (1 << 12) /* Bit 12: AHB buffer overflow interrupt enable flag (ABOIE) */
#define QSPI_RSER_AIBSIE                  (1 << 13) /* Bit 13: AHB illegal burst size interrupt enable flag (AIBSIE) */
#define QSPI_RSER_AITIE                   (1 << 14) /* Bit 14: AHB illegal transaction interrupt enable flag (AITIE) */
                                                    /* Bit 15: Reserved */
#define QSPI_RSER_RBDIE                   (1 << 16) /* Bit 16: RX buffer drain interrupt enable (RBDIE) */
#define QSPI_RSER_RBOIE                   (1 << 17) /* Bit 17: RX buffer overflow interrupt enable (RBOIE) */
                                                    /* Bits 18-20: Reserved */
#define QSPI_RSER_RBDDE                   (1 << 21) /* Bit 21: RX buffer drain DMA enable (RBDDE) */
                                                    /* Bit 22: Reserved */
#define QSPI_RSER_ILLINIE                 (1 << 23) /* Bit 23: Illegal instruction error interrupt enable (ILLINIE) */
                                                    /* Bit 24: Reserved */
#define QSPI_RSER_TBFDE                   (1 << 25) /* Bit 25: TX buffer fill DMA enable (TBFDE) */
#define QSPI_RSER_TBUIE                   (1 << 26) /* Bit 26: TX buffer underrun interrupt enable flag (TBUIE) */
#define QSPI_RSER_TBFIE                   (1 << 27) /* Bit 27: TX buffer fill interrupt enable flag (TBFIE) */
                                                    /* Bits 28-31: Reserved */

/* Sequence Pointer Clear Register (SPTRCLR) */

#define QSPI_SPTRCLR_BFPTRC               (1 << 0)  /* Bit 0: Buffer pointer clear (BFPTRC) */
                                                    /* Bits 1-7: Reserved */
#define QSPI_SPTRCLR_IPPTRC               (1 << 8)  /* Bit 8: IP pointer clear (IPPTRC) */
                                                    /* Bits 9-31: Reserved */

/* Serial Flash Memory An/Bn Top Address Register (SFAnAD/SFBnAD) */

                                                    /* Bits 0-9: Reserved */
#define QSPI_SFAD_TPAD_SHIFT              (10)      /* Bits 10-31: Top address for serial flash memory An/Bn (TPADAn/TPADBn) */
#define QSPI_SFAD_TPAD_MASK               (0x3fffff << QSPI_SFAD_TPAD_SHIFT)
#define QSPI_SFAD_TPAD(n)                 (((n) << QSPI_SFAD_TPAD_SHIFT) & QSPI_SFAD_TPAD_MASK)

/* RX Buffer Data Register (RBDRn, n=0,...,63) */

