apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_qspi.h
#define QSPI_RBDR_RXDATA_SHIFT            (0)       /* Bits 0-31: RX data (RXDATA) */
#define QSPI_RBDR_RXDATA_MASK             (0xffffffff << QSPI_RBDR_RXDATA_SHIFT)

/* LUT Key Register (LUTKEY) */

#define QSPI_LUTKEY_KEY_SHIFT             (0)       /* Bits 0-31: Key to lock or unlock the LUT (KEY) */
#define QSPI_LUTKEY_KEY_MASK              (0xffffffff << QSPI_LUTKEY_KEY_SHIFT)
#define QSPI_LUTKEY_KEY                   (0x5AF05AF0ul)

/* LUT Lock Configuration Register (LKCR) */

#define QSPI_LKCR_LOCK                    (1 << 0)  /* Bit 0: Lock LUT (LOCK) */
#define QSPI_LKCR_UNLOCK                  (1 << 1)  /* Bit 1: Unlock LUT (UNLOCK) */
                                                    /* Bits 2-31: Reserved */

/* LUT Register (LUTn) */

#define QSPI_LUT_OPRND0_SHIFT             (0)       /* Bits 0-7: Operand for INSTR0 (OPRND0) */
#define QSPI_LUT_OPRND0_MASK              (0xff << QSPI_LUT_OPRND0_SHIFT)
#define QSPI_LUT_OPRND0(n)                (((n) << QSPI_LUT_OPRND0_SHIFT) & QSPI_LUT_OPRND0_MASK)
#define QSPI_LUT_PAD0_SHIFT               (8)       /* Bits 8-9: Pad information for INSTR0 (PAD0) */
#define QSPI_LUT_PAD0_MASK                (0x03 << QSPI_LUT_PAD0_SHIFT)
#  define QSPI_LUT_PAD0_1                 (0x00 << QSPI_LUT_PAD0_SHIFT) /* 1 Pad */
#  define QSPI_LUT_PAD0_2                 (0x01 << QSPI_LUT_PAD0_SHIFT) /* 2 Pad */
#  define QSPI_LUT_PAD0_4                 (0x02 << QSPI_LUT_PAD0_SHIFT) /* 4 Pad */

#define QSPI_LUT_INSTR0_SHIFT             (10)      /* Bits 10-15: Instruction 0 (INSTR0) */
#define QSPI_LUT_INSTR0_MASK              (0x3f << QSPI_LUT_INSTR0_SHIFT)
#define QSPI_LUT_INSTR0(n)                (((n) << QSPI_LUT_INSTR0_SHIFT) & QSPI_LUT_INSTR0_MASK)

#define QSPI_LUT_OPRND1_SHIFT             (16)       /* Bits 16-23: Operand for INSTR1 (OPRND1) */
#define QSPI_LUT_OPRND1_MASK              (0xff << QSPI_LUT_OPRND1_SHIFT)
#define QSPI_LUT_OPRND1(n)                (((n) << QSPI_LUT_OPRND1_SHIFT) & QSPI_LUT_OPRND1_MASK)
#define QSPI_LUT_PAD1_SHIFT               (24)       /* Bits 24-25: Pad information for INSTR1 (PAD1) */
#define QSPI_LUT_PAD1_MASK                (0x03 << QSPI_LUT_PAD1_SHIFT)
#  define QSPI_LUT_PAD1_1                 (0x00 << QSPI_LUT_PAD1_SHIFT) /* 1 Pad */
#  define QSPI_LUT_PAD1_2                 (0x01 << QSPI_LUT_PAD1_SHIFT) /* 2 Pad */
#  define QSPI_LUT_PAD1_4                 (0x02 << QSPI_LUT_PAD1_SHIFT) /* 4 Pad */

#define QSPI_LUT_INSTR1_SHIFT             (26)      /* Bits 26-31: Instruction 1 (INSTR1) */
#define QSPI_LUT_INSTR1_MASK              (0x3f << QSPI_LUT_INSTR1_SHIFT)
#define QSPI_LUT_INSTR1(n)                (((n) << QSPI_LUT_INSTR1_SHIFT) & QSPI_LUT_INSTR1_MASK)

/* External Memory Base Address */

#define QSPI_AMBA_BASE    0x68000000

/* flash connection to the QSPI module */

typedef enum
{
  QSPI_SIDE_A1    = 0x00u,  /* Serial flash connected on side A1 */
  QSPI_SIDE_A2    = 0x01u,  /* Serial flash connected on side A2 */
  QSPI_SIDE_B1    = 0x02u,  /* Serial flash connected on side B1 */
  QSPI_SIDE_B2    = 0x03u,  /* Serial flash connected on side B2 */
} s32k3xx_qspi_connectiontype;

/* flash operation type */

typedef enum
{
  QSPI_OP_TYPE_CMD          = 0x00u,  /* Simple command                         */
  QSPI_OP_TYPE_WRITE_REG    = 0x01u,  /* Write value in external flash register */
  QSPI_OP_TYPE_RMW_REG      = 0x02u,  /* RMW command on external flash register */
  QSPI_OP_TYPE_READ_REG     = 0x03u,  /* Read external flash register until expected value is read */
  QSPI_OP_TYPE_QSPI_CFG     = 0x04u,  /* Re-configure QSPI controller           */
} s32k3xx_qspi_optype;

/* Lut commands */

typedef enum
{
  QSPI_LUT_INSTR_STOP            = (0u << 10u),    /* End of sequence                           */
  QSPI_LUT_INSTR_CMD             = (1u << 10u),    /* Command                                   */
  QSPI_LUT_INSTR_ADDR            = (2u << 10u),    /* Address                                   */
  QSPI_LUT_INSTR_DUMMY           = (3u << 10u),    /* Dummy cycles                              */
  QSPI_LUT_INSTR_MODE            = (4u << 10u),    /* 8-bit mode                                */
  QSPI_LUT_INSTR_MODE2           = (5u << 10u),    /* 2-bit mode                                */
  QSPI_LUT_INSTR_MODE4           = (6u << 10u),    /* 4-bit mode                                */
  QSPI_LUT_INSTR_READ            = (7u << 10u),    /* Read data                                 */
  QSPI_LUT_INSTR_WRITE           = (8u << 10u),    /* Write data                                */
  QSPI_LUT_INSTR_JMP_ON_CS       = (9u << 10u),    /* Jump on chip select deassert and stop     */
  QSPI_LUT_INSTR_ADDR_DDR        = (10u << 10u),   /* Address - DDR mode                        */
  QSPI_LUT_INSTR_MODE_DDR        = (11u << 10u),   /* 8-bit mode - DDR mode                     */
  QSPI_LUT_INSTR_MODE2_DDR       = (12u << 10u),   /* 2-bit mode - DDR mode                     */
  QSPI_LUT_INSTR_MODE4_DDR       = (13u << 10u),   /* 4-bit mode - DDR mode                     */
  QSPI_LUT_INSTR_READ_DDR        = (14u << 10u),   /* Read data - DDR mode                      */
  QSPI_LUT_INSTR_WRITE_DDR       = (15u << 10u),   /* Write data - DDR mode                     */
  QSPI_LUT_INSTR_DATA_LEARN      = (16u << 10u),   /* Data learning pattern                     */
  QSPI_LUT_INSTR_CMD_DDR         = (17u << 10u),   /* Command - DDR mode                        */
  QSPI_LUT_INSTR_CADDR           = (18u << 10u),   /* Column address                            */
  QSPI_LUT_INSTR_CADDR_DDR       = (19u << 10u),   /* Column address - DDR mode                 */
  QSPI_LUT_INSTR_JMP_TO_SEQ      = (20u << 10u),   /* Jump on chip select deassert and continue */
} s32k3xx_qspi_lutcommandstype;

/* Lut pad options */

typedef enum
{
  QSPI_LUT_PADS_1              = (0u << 8u),    /* 1 Pad */
  QSPI_LUT_PADS_2              = (1u << 8u),    /* 2 Pads */
  QSPI_LUT_PADS_4              = (2u << 8u),    /* 4 Pads */
  QSPI_LUT_PADS_8              = (3u << 8u),    /* 8 Pads */
} s32k3xx_qspi_lutpadstype;

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_QSPI_H */
